# Python プログラムの基本文法(変数，四則演算，リスト)，入出力を，演習しながら覚える．

# (1) 画面に表示 print( )
# 文字・数値の表示，変数の中身の表示は print()を使う.C言語の printf に似た機能. 
# <演習>以下のプログラム(2行)を入力して，その後に実行して結果を確認しなさい.
# print(1.2)
# print("プログラム",1,3.0)
# 実行結果: プログラム　1 3.0

# (2) 変数
# 種類は C 言語と同じ.なお，型宣言は不要である.
# <演習>以下を入力して，その後に実行して結果を確認しなさい.
# a=2
# b=0.2
# c="こんにちは"
# print(a,b,c)
# 実行結果: 2 0.2 こんにちは

# (3) 足し算，引き算など
# 演算記号は C 言語と同じ. <演習>新たなセルに次のプログラムを入力して，その後に実行して結果を確認しなさい.
# a = 10; b = 4
# sum = a+b #足し算
# sub = a-b #引き算
# mul = a*b #掛け算
# div = a/b #割り算
# sur = a%b #余り
# print(sum, sub, mul, div, sur)
# 実行結果: 14 6 40 2.5 2
